app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "12"], ["text", "222"], ["created_at", "2016-02-18 07:12:27.932165"], ["updated_at", "2016-02-18 07:12:27.932165"]]
---
def create
  @article = Article.new(article_params)

  if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 5]]
---
 def show
  @article = Article.find(params[:id])

SELECT "articles".* FROM "articles"
---
def index
  @articles = Article.all

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
---
def edit
  @article = Article.find(params[:id])

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "12saSasaSA"], ["text", "222sa"], ["updated_at", "2016-02-18 08:41:15.536290"], ["id", 1]]
---
def update
  @article = Article.find(params[:id])

  if @article.update(article_params)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 2]]
---
def destroy
  @article = Article.find(params[:id])
  @article.destroy